# Assignment 7

# Problem Statement 1

1) How-to-count-distance-to-the-previous-zero
For each value, count the difference of the distance from the previous zero (or the start of
the Series, whichever is closer) and if there are no previous zeros, print the position
Consider a DataFrame df where there is an integer column {'X'[7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}
The values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.
import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [53]:
import pandas as pd

df = pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4]})
cnt = 0
y=[]
for x in df['X']:
    if x != 0:
        cnt += 1
    else:
        cnt=0
    y.append(cnt)
df['Y'] = y
print(df)

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

2) Create a DatetimeIndex that contains each business day of 2015 and use it to index a
Series of random numbers.

In [1]:
from numpy.random import randint as ri
import pandas as pd
dtidx=pd.date_range(start ='2015-01-01 00:00',end='2015-12-31 23:59',freq='B')
rval = ri(1,100,dtidx.size)
df=pd.DataFrame({'Random Numbers':rval,'DateTimeIndex':dtidx})
print(df.set_index('DateTimeIndex'))

               Random Numbers
DateTimeIndex
2015-01-01                 33
2015-01-02                 67
2015-01-05                 13
2015-01-06                 94
2015-01-07                 67
...                       ...
2015-12-25                  8
2015-12-28                 91
2015-12-29                 81
2015-12-30                 77
2015-12-31                 77

[261 rows x 1 columns]

3) Find the sum of the values in s for every Wednesday

In [3]:
wed_dates=[d for d in df['DateTimeIndex'] if d.weekday() == 2]
df['Wednesdays'] = df['DateTimeIndex'].apply(lambda x: 'TRUE' if x in wed_dates else 'FALSE')
df2=df[df['Wednesdays'] == 'TRUE']
print("Sum of all values in s for every Wednesday is: ",df2['Random Numbers'].sum())

Sum of all values in s for every Wednesday is:  2791

4) Average For each calendar month

In [220]:
df['Month'] = df['DateTimeIndex'].apply(lambda x: x.month)
df
month_dict={1:'January',2:'February',3:'March',4:'April',5:'May',6:'June',7:'July',8:'August',9:'September',10:'October',11:'November',12:'December'}
for i in range(1,13):
    df2=df[df['Month'] == i]
    print("Average of ",month_dict[i], " month is: ",df2['Random Numbers'].describe()[1])

Average of  January  month is:  56.04545454545455
Average of  February  month is:  44.85
Average of  March  month is:  47.54545454545455
Average of  April  month is:  46.45454545454545
Average of  May  month is:  46.666666666666664
Average of  June  month is:  56.95454545454545
Average of  July  month is:  55.95652173913044
Average of  August  month is:  56.95238095238095
Average of  September  month is:  44.90909090909091
Average of  October  month is:  47.63636363636363
Average of  November  month is:  54.61904761904762
Average of  December  month is:  46.91304347826087

5) For each group of four consecutive calendar months in s, find the date on which the highest
value occurred.

In [254]:
df['Month'] = df['DateTimeIndex'].apply(lambda x: x.month)
max_values=[df[df['Month'] == i]['Random Numbers'].describe()[7] for i in range(1,13)]
print(max_values)
new_max_val = []
for i in range(1,len(max_values),4):
    new_max_val.append(max(max_values[i:i+4]))
print(new_max_val)

date_list=[]
for val in set(new_max_val):
    date_list.append(df[df['Random Numbers'] == val]['DateTimeIndex'])

print("The dates for which each group , of four consecutive calendar months, had the highest value are:")
for d in date_list:
    print(d)

[97.0, 99.0, 88.0, 92.0, 97.0, 91.0, 97.0, 98.0, 97.0, 91.0, 98.0, 96.0]
[99.0, 98.0, 98.0]
The dates for which each group , of four consecutive calendar months, had the highest value are:
158   2015-08-11
226   2015-11-13
Name: DateTimeIndex, dtype: datetime64[ns]
23   2015-02-03
Name: DateTimeIndex, dtype: datetime64[ns]

# Problem Statement 2

Read the dataset from the below link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Nam
es_right.csv

In [2]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

Questions:

1) Delete unnamed columns

In [65]:
print("Columns in csv before dropping unnamed columns: ",df.columns)
for col in df.columns:
    if 'unnamed' in col.lower():
        df.drop([col],axis=1,inplace=True)
print("Columns in csv aftere dropping unnamed columns: ",df.columns)
df.head(10)

Columns in csv before dropping unnamed columns:  Index(['Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')
Columns in csv aftere dropping unnamed columns:  Index(['Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

      Id      Name  Year Gender State  Count
0  11350      Emma  2004      F    AK     62
1  11351   Madison  2004      F    AK     48
2  11352    Hannah  2004      F    AK     46
3  11353     Grace  2004      F    AK     44
4  11354     Emily  2004      F    AK     41
5  11355   Abigail  2004      F    AK     37
6  11356    Olivia  2004      F    AK     33
7  11357  Isabella  2004      F    AK     30
8  11358    Alyssa  2004      F    AK     29
9  11359    Sophia  2004      F    AK     28

2) Show the distribution of male and female

In [62]:
import numpy
df.loc[:,['Gender','Year','Count']].groupby(['Gender','Year']).sum()

               Count
Gender Year
F      2004  1523496
       2005  1528165
       2006  1564886
       2007  1576648
       2008  1544411
       2009  1493172
       2010  1439346
       2011  1422539
       2012  1422020
       2013  1419351
       2014  1446259
M      2004  1770488
       2005  1777150
       2006  1822851
       2007  1835769
       2008  1795907
       2009  1738944
       2010  1677202
       2011  1656606
       2012  1651838
       2013  1647092
       2014  1667352

# OR

In [64]:
# Gender distribution considering the names being shared by people and cumulating the counts based on that
df.loc[:,['Gender','Count']].groupby(['Gender']).sum()

           Count
Gender
F       16380293
M       19041199

# OR

In [3]:
# Gender distribution considering the count of names
df['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

3) Show the top 5 most preferred names

In [61]:
import numpy
df2=df[['Name','Count']].groupby(['Name']).sum().sort_values(by=['Count'],ascending=False).head(5)
df2

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

4) What is the median name occurrence in the dataset

In [58]:
import numpy
df2=df[['Name','Count']].groupby(['Name']).sum().sort_values(by=['Count'])
median_count=df2.median(axis=0)
df2[df2['Count'] == median_count['Count']].loc[:,['Count']]

            Count
Name
Caleah         49
Anely          49
Alysse         49
Emmanuela      49
Carlota        49
...           ...
Sanjuanita     49
Jeovany        49
Deante         49
Jaice          49
Leylanie       49

[66 rows x 1 columns]

5) Distribution of male and female born count by states

In [54]:
df.loc[:,['Gender','State','Count']].groupby(['Gender','State']).sum()

                Count
Gender State
F      AK       26250
       AL      215308
       AR      129712
       AZ      368567
       CA     2414063
...               ...
M      VT       21353
       WA      395377
       WI      311758
       WV       93557
       WY       21912

[102 rows x 1 columns]